### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_task_definition.default[0] has changed
  ~ resource "aws_ecs_task_definition" "default" {
        id                       = "gost-staging-api"
+       tags                     = {}
        # (13 unchanged attributes hidden)

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id          = "fs-08f95063c1cdbe191"
+               root_directory          = "/"
+               transit_encryption      = "ENABLED"
+               transit_encryption_port = 0

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-08f95063c1cdbe191" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
        name                  = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-08-29T23:31:20Z" -> "2023-09-05T17:34:27Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-staging-api-ECSTask-2023021701041477300000000a"
        name                  = "gost-staging-api-ECSTask-2023021701041477300000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2023-08-29T23:33:32Z" -> "2023-09-05T16:43:30Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # datadog_monitor.consume_grants-event_failed[0] will be created
+   resource "datadog_monitor" "consume_grants-event_failed" {
+       enable_samples      = (known after apply)
+       evaluation_delay    = 900
+       id                  = (known after apply)
+       include_tags        = true
+       message             = <<-EOT
            {{#is_alert}}
            Alert: One or more grant modification events were received from the SQS source queue but failed to process after several attempts.
            As a result SQS messages for failed events have been redirected to the SQS dead-letter queue (DLQ).
            Investigate the issue (especially by checking consume_grants ECS task logs).
            Once the issue is resolved, send the failed event messages from the SQS DLQ back to the source queue.
            This monitor will not return to normal while there are messages in the DLQ.
            {{/is_alert}}
            {{#is_recovery}}
            Recovery: There are no longer messages in the DLQ.
            {{/is_recovery}}
            Notify:
        EOT
+       name                = "GOST (Draft - staging): Grant modification events failed to process"
+       new_host_delay      = 300
+       notify_no_data      = false
+       query               = "min(last_1h):avg:aws.sqs.approximate_number_of_messages_visible{env:staging,queuename:gost-staging-grants-ingest_events-dlq-20230713221152505300000006} > 0"
+       require_full_window = true
+       tags                = [
+           "env:staging",
+           "service:gost",
+           "team:grants",
        ]
+       type                = "metric alert"
    }

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:27" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] must be replaced
+/- resource "aws_ecs_task_definition" "default" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:27" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "497226f03dd8c8d3bb8eaf00a2c34092fbd81512" -> "4047958f49ebccd64655da486965424f494b34ea"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (5 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "497226f03dd8c8d3bb8eaf00a2c34092fbd81512" -> "4047958f49ebccd64655da486965424f494b34ea"
                        },
                        {
                            name  = "ENABLE_GRANTS_DIGEST"
                            value = "false"
                        },
                        # (8 unchanged elements hidden)
                    ]
                    name                   = "api"
-                   volumesFrom            = [] -> null
                    # (10 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  ~ dockerLabels           = {
                      ~ "com.datadoghq.tags.version" = "497226f03dd8c8d3bb8eaf00a2c34092fbd81512" -> "4047958f49ebccd64655da486965424f494b34ea"
                        # (2 unchanged elements hidden)
                    }
                  ~ environment            = [
                        # (3 unchanged elements hidden)
                        {
                            name  = "DD_SERVICE"
                            value = "gost"
                        },
                      ~ {
                            name  = "DD_VERSION"
                          ~ value = "497226f03dd8c8d3bb8eaf00a2c34092fbd81512" -> "4047958f49ebccd64655da486965424f494b34ea"
                        },
                        {
                            name  = "ECS_FARGATE"
                            value = "true"
                        },
                    ]
-                   mountPoints            = [] -> null
                    name                   = "datadog"
-                   portMappings           = [] -> null
-                   volumesFrom            = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "gost-staging-api" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id          = "fs-08f95063c1cdbe191" -> null
-               root_directory          = "/" -> null
-               transit_encryption      = "ENABLED" -> null
-               transit_encryption_port = 0 -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # module.api.aws_iam_role_policy.execution["decrypt-secrets"] will be updated in-place
  ~ resource "aws_iam_role_policy" "execution" {
        id     = "gost-staging-api-ECSTaskExecution-20230217010414321500000009:decrypt-secrets"
        name   = "decrypt-secrets"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "kms:Decrypt"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb"
-                       Sid      = "DecryptWithKMS"
                    },
-                   {
-                       Action   = [
-                           "ssm:GetParameters",
-                           "secretsmanager:GetSecretValue",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/postgres/connection_string",
-                           "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key",
-                           "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/api/cookie_secret",
                        ]
-                       Sid      = "GetSecretParameters"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_iam_role_policy.task["connect-to-postgres"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-staging-api-ECSTask-2023021701041477300000000a:connect-to-postgres"
        name   = "connect-to-postgres"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "rds-db:connect"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-MB5CSR4GERRMATFYFNW7H6HPWY/postgres"
-                       Sid      = "DBAccess"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-consume_grants"
        name                               = "gost-staging-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:12" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants must be replaced
+/- resource "aws_ecs_task_definition" "consume_grants" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "gost-staging-consume_grants" -> (known after apply)
-       ipc_mode                 = "" -> null
-       pid_mode                 = "" -> null
      ~ revision                 = 12 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.consume_grants.aws_iam_role_policy.task["connect-to-postgres"] will be updated in-place
  ~ resource "aws_iam_role_policy" "task" {
        id     = "gost-staging-consume_grants-ECSTask-20230713221152510500000008:connect-to-postgres"
        name   = "connect-to-postgres"
      ~ policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "rds-db:connect"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:rds-db:us-west-2:357150818708:dbuser:cluster-MB5CSR4GERRMATFYFNW7H6HPWY/postgres"
-                       Sid      = "DBAccess"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.api.module.connect_to_postgres_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "rds-db:connect",
            ]
+           effect    = "Allow"
+           resources = (sensitive value)
+           sid       = "DBAccess"
        }
    }

  # module.api.module.decrypt_secrets_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "kms:Decrypt",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:kms:us-west-2:357150818708:key/df1661b4-62e5-4668-8e39-f872c9acfceb",
            ]
+           sid       = "DecryptWithKMS"
        }
+       statement {
+           actions   = [
+               "secretsmanager:GetSecretValue",
+               "ssm:GetParameters",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/api/cookie_secret",
+               "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key",
+               "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/postgres/connection_string",
            ]
+           sid       = "GetSecretParameters"
        }
    }

  # module.consume_grants.module.connect_to_postgres_policy.data.aws_iam_policy_document.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "rds-db:connect",
            ]
+           effect    = "Allow"
+           resources = (sensitive value)
+           sid       = "DBAccess"
        }
    }

  # module.postgres.module.db.aws_rds_cluster.this[0] will be updated in-place
  ~ resource "aws_rds_cluster" "this" {
      ~ copy_tags_to_snapshot               = false -> true
        id                                  = "gost-staging-postgres-20230217010405040800000006"
        tags                                = {}
        # (44 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgres.module.db.aws_rds_cluster_instance.this["one"] will be updated in-place
  ~ resource "aws_rds_cluster_instance" "this" {
      ~ copy_tags_to_snapshot                 = false -> true
        id                                    = "gost-staging-postgres-one"
        tags                                  = {}
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 7 to change, 2 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: `Terraform CI`*